/*==============================================================*/
/* We use this seed data sql file to make sure our test data    */
/* sets are the same. So make sure there aren't any conflicts.  */
/*==============================================================*/

/*==============================================================*/
/* Table: USERCOUNT                                             */
/* Most of the time we will use 'test' as default usercount,    */
/* but you are free to use your own name. :)                    */
/*==============================================================*/

insert into usercount values (300, 'test', 'test@poem.com', '123456');
insert into usercount values (301, 'keke', 'keke@poem.com', '123456');
insert into usercount values (302, 'shuji', 'shuji@poem.com', '123456');
insert into usercount values (303, 'erlei', 'erlei@poem.com', '123456');
insert into usercount values (304, 'chengli', 'chengli@poem.com', '123456');
insert into usercount values (305, 'xingxing', 'xingxing@poem.com', '123456');
insert into usercount values (306, 'rongrong', 'rongrong@poem.com', '123456');
insert into usercount values (307, 'dandan', 'dandan@poem.com', '123456');
commit;

/*==============================================================*/
/* Table: AUTHOR                                                */
/*==============================================================*/

insert into author
values
  (300,
   '范仲淹',
   '范仲淹（989-1052），字希文，北宋吴县（今江苏省苏州市）人。他在当时是著名的军事家、政治家，官至副宰相。他了解民间疾苦，深知宋王朝在政治，经济、军事等方面存在的问题，主张革除积弊，但因统治集团内部守旧派的反对，没能实现。');
insert into author
values
  (301,
   '晏殊',
   '晏殊（991-1055），字同叔，北宋临川（今江西抚州市）人。他是北宋初期的重要作家，擅长诗词，尤以写词著名。他很讲究词的意境，语言凝炼自然，对后代有影响。');
insert into author
values
  (302,
   '欧阳修',
   '欧阳修（1007－1073），字永叔，号醉翁，又号六一居士。出生于四川绵州（今四川绵阳涪城区内），祖籍：江西永丰,自称庐陵（今永丰县沙溪人）。谥号文忠，世称欧阳文忠公，北宋卓越的文学家、史学家。');
commit;

/*==============================================================*/
/* Table: POEM                                                  */
/*==============================================================*/

insert into poem
values
  (300,
   300,
   '渔家傲·塞下秋来风景异',
   '塞下秋来风景异，衡阳雁去无留意。四面边声连角起，千嶂里，长烟落日孤城闭。浊酒一杯家万里，燕然未勒归无计。羌管悠悠霜满地。人不寐，将军白发征夫泪。',
   '边境上秋天一来风景全异，向衡阳飞去的雁群毫无留恋的情意。从四面八方传来的边地悲声随着号角响起。重重叠叠的山峰里，长烟直上落日斜照孤城紧闭。喝一杯陈酒怀念家乡远隔万里，可是燕然还未刻上平胡的功绩，归期无法预计。羌人的笛声悠扬，寒霜撒满大地。征人不能入睡，将军头发花白，战士洒下眼泪。',
   '①塞下：边地。风景异：指景物与江南一带不同。②衡阳雁去：雁去衡阳的倒文。湖南衡阳县南有回雁峰，相传雁至此不再南飞。③边声：马嘶风号之类的边地荒寒肃杀之声。角：军中的号角。④嶂：像屏障一样并列的山峰。⑤长烟：荒漠上的烟。⑥燕然未勒：无破敌之功。燕然：山名，即今蒙古境内之杭爱山。勒：刻石记功。东汉窦宪追击北匈奴，出塞三千馀里，至燕然山刻石记功而还。燕然未勒：指边患未平、功业未成。⑦羌管：羌笛，因出自羌中，得名。⑧霜满地：喻夜深寒重。',
   '词的上片写塞上秋天的景色。边塞地区本来就较落后，又遭到长期战乱的破坏，春夏两季国有绿杨青草的点缀，人们不会觉得它太荒凉。但秋风一来，草木雕零，四处光秃秃的。景象顿然改变了。作者是江南人，对西北之秋特别敏感。他觉得这里和自己家乡的秋天是不同的，所以说“塞下秋来风景异”。“异”，不同。不用说人会思念家乡，连长空不时飞过的雁群也显得那么匆忙，它们似乎也不愿停留，想早早离开这里飞回到衡阳去，因此，又说“衡阳雁去无留意”。这是倒装句，正常的词序应是“雁去衡阳”。大雁是候鸟，每年秋天成群往南飞，衡阳城南有一座回雁峰，传说大雁到此为止。作者大约是巡视归来，在途中望见了南飞雁。这时天色已近黄昏，边城的军营中响起了召唤部队的号角声，即所谓“四面边声连角起”。“角”，古代军中一种吹的乐器。角声应和着四面八方的边声在耳畔鸣响。“边声”，指形成边地悲凉气氛的声音，如风吼、马嘶、少数民族的音乐声等等。“千嶂里，长烟落日孤城闭。”象屏风一样的山叫“嶂”。群山莽莽，重重叠叠，所以词里用“千嶂”来描写。“长烟”，形容雾气一大片。这时一大片雾气弥漫在落日的孤城上空。边地戒备森严，城门已经关闭了。词的上片所写的凄凉景象，显然是染上了作者当时的感情色彩。');
insert into poem
values
  (301,
   300,
   '苏幕遮·碧云天',
   '碧云天，黄叶地，秋色连波，波上寒烟翠。山映斜阳天接水。芳草无情，更在斜阳外。黯乡魂，追旅思，夜夜除非，好梦留人睡。明月楼高休独倚，酒入愁肠，化作相思泪。',
   '白云满天，黄叶遍地。秋天的景色映进江上的碧波，水波上笼罩着寒烟一片苍翠。远山沐浴着夕阳，天空连接江水。岸边的芳草似是无情，又在西斜的太阳之外。思念家乡黯然销魂，羁旅的愁思缠绕不休。只有在梦中得到暂时的慰藉。当明月照射高楼时不要独自依倚，端起酒来洗涤愁肠，可是都化作相思的眼泪。',
   '①黯：形容心情忧郁。黯乡魂：思念家乡，心情颓丧。②追：追随，可引申为纠缠。旅思：羁旅之思。③旅思（sì）：旅居在外的愁思。思，心绪，愁思。④追旅思：往事的追忆引起了羁旅的愁怀。',
   '“碧云天，黄叶地”二句，一高一低，一俯一仰，展现了际天极地的苍莽秋景，为元代王实甫《西厢记》“长亭送别”一折所本。《西厢记》第四本第三折《长亭送别》〔正宫端正好〕云：“碧云天，黄花地，西风紧，北雁南飞。晓来谁染霜林醉，总是离人泪。”即由此词点染而成。“秋色连波”二句，落笔于高天厚地之间的浓郁的秋色和绵邈秋波：秋色与秋波相连于天边，而依偎着秋波的则是空翠而略带寒意的秋烟。这里，碧云，黄叶，绿波，翠烟，构成一幅色彩斑斓的画面。“山映斜阳”句复将青山摄入画面，并使天、地、山、水融为一体，交相辉映。同时，“斜阳”又点出所状者乃是薄暮时分的秋景。“芳草无情”二句，由眼中实景转为意中虚景，而离情别绪则隐寓其中。埋怨“芳草”无情，正见出作者多情、重情。自淮南小山《招隐士》“王孙游兮不归，春草生兮萋萋”之后，“芳草”往往与离情密不可分，它的季节特征反而在其次。');
insert into poem
values
  (302,
   301,
   '浣溪沙·一曲新词酒一杯',
   '一曲新词酒一杯，去年天气旧亭台。夕阳西下几时回？无可奈何花落去，似曾相识燕归来，小园香径独徘徊。',
   '听着一曲诗词喝着一杯美酒。想起去年同样的季节还是这种楼台和亭子。天边西下的夕阳什么时候才又转回这里？花儿总要凋落是让人无可奈何的事。那翩翩归来的燕子好生眼熟的像旧时的相识。在弥漫花香的园中小路上，我独自地走来走去。',
   '①一曲新词酒一杯：此句化用白居易《长安道》诗意：“花枝缺入青楼开，艳歌一曲酒一杯”。一曲，一首。因为词是配合音乐唱的，故称“曲”。新词，刚填好的词，意指新歌。酒一杯，一杯酒。②去年天气旧亭台：是说天气、亭台都和去年一样。此句化用五代郑谷《和知已秋日伤感》诗：“流水歌声共不回，去年天气旧池台。”晏词“亭台”一本作“池台”。去年天气，是说跟去年此日相同的天气。旧亭台，曾经到过的或熟悉的亭台楼阁。旧，旧时。③夕阳：落日。④西下：向西方地平线落下。⑤几时回：什么时候回来。⑥无可奈何：不得已，没有办法。⑦似曾相识：好像曾经认识。形容见过的事物再度出现。后用作成语，即出自晏殊此句。⑧燕归来：燕子从南方飞回来。燕归来，春中常景，在有意无意之间。⑨小园香径：花草芳香的小径，或指落花散香的小径。因落花满径，幽香四溢，故云香径。香径，带着幽香的园中小径。独：副词，用于谓语前，表示“独自”的意思。徘徊：来回走。',
   '起句“一曲新词酒一杯，去年天气旧亭台。”写对酒听歌的现境。从复叠错综的句式、轻快流利的语调中可以体味出，词人面对现境时，开始是怀着轻松喜悦的感情，带着潇洒安闲的意态的，似乎主人公十分醉心于宴饮涵咏之乐。的确，作为安享尊荣而又崇文尚雅的“太平宰相”，以歌侑酒，是作者习于问津、也乐于问津的娱情遣兴方式之一。但边听边饮，这现境却又不期然而然地触发对“去年”所历类似境界的追忆：也是和“今年”一样的暮春天气，面对的也是和眼前一样的楼台亭阁，一样的清歌美酒。然而，似乎一切依旧的表象下又分明感觉到有的东西已经起了难以逆转的变化，这便是悠悠流逝的岁月和与此相关的一系列人事。此句中正包蕴着一种景物依旧而人事全非的怀旧之感。在这种怀旧之感中又糅合着深婉的伤今之情。这样，作者纵然襟怀冲澹，又怎能没有些微的伤感呢？于是词人不由得从心底涌出这样的喟叹：“夕阳西下几时回？”夕阳西下，是眼前景。但词人由此触发的，却是对美好景物情事的流连，对时光流逝的怅惘，以及对美好事物重现的微茫的希望。这是即景兴感，但所感者实际上已不限于眼前的情事，而是扩展到整个人生，其中不仅有感性活动，而且包含着某种哲理性的沉思。夕阳西下，是无法阻止的，只能寄希望于它的东升再现，而时光的流逝、人事的变更，却再也无法重复。细味“几时回”三字，所折射出的似乎是一种企盼其返、却又情知难返的纡细心态。');
insert into poem
values
  (303,
   301,
   '浣溪沙·一向年光有限身',
   '一向年光有限身，等闲离别易消魂，酒筵歌席莫辞频。满目山河空念远，落花风雨更伤春，不如怜取眼前人。',
   '年华易逝，人生是多么的短暂，一次平常的离别也会引起极度的悲伤和愁苦，还是及时行乐欢歌筵饮吧，不要嫌歌舞酒宴太多太频而推辞。 登高望远，放眼辽阔的河山，便怀思远别的亲友；看到风雨摧落繁花，更是伤感春光易逝。空念远亲和落花伤春都是徒劳无益，还不如去怜爱眼前这轻歌曼舞的美人吧。',
   '①一向：一晌，片刻。②有限身：意思是人生短暂。③等闲：平常，一般。④消魂：灵魂离开肉体。意思是极度悲伤、痛苦，或极度快乐。⑤频：多次。⑥怜：珍惜，怜爱。⑦取：语助词。',
   '“ 一向年光有限身”，劈空而来，语甚警炼。“一向”，即一晌，一会儿。片刻的时光啊，有限的生命！词人的哀怨是永恒的，那是无法抗拒的自然规律，谁不希望美好的年华能延续下去呢？惜春光之易逝，感盛年之不再，这虽是《珠玉词》中常有的慨叹，而本词中强烈地直接呼喊出来，便有撼人心魄的效果。紧接“等闲”句，加厚一笔。词中所写的，不是生离，更不是死别，而只不过是寻常的离别而已！“等闲”二字，殊不等闲，具见词人之深于情。在短暂的人生中，别离是不只一次会遇到的，而每一回离别，都占去有限年光的一部分，词人唯有强自宽解：“ 酒筵歌席莫辞频”。痛苦是无益的，不如对酒当歌， 自遣情怀吧。“频”，谓宴会的频繁。叶梦得《避暑录话》载，晏殊“惟喜宾客，未尝一日不宴饮，每有嘉客必留，留亦必以歌乐相佐”，“日以饮酒赋诗为乐，佳时胜日，未尝辄废”。“酒筵歌席”，即指这些日常的宴饮。这句写及时行乐，聊慰此有限之身。过片二语，气象宏阔，意境莽苍，以健笔写闲情，兼有刚柔之美，是《珠玉词》中不可多得的佳句。两句是设想之辞。若是登临之际，放眼辽阔的河山，徒然地怀思远别的亲友；就算是独处家中，看到风雨摧落了繁花，更令人感伤春光易逝。语本李峤《汾阴行》：“山川满目泪沾衣，富贵荣华能几时？”作者不欲刻意去伤春伤别，故要想办法从痛苦中解脱出来。吴梅《词学通论》特标举此二语，认为较大晏的名句“无可奈何花落去，似曾相识燕归来”胜过十倍而人未知之。吴氏之语虽稍偏颇，而确是能独具慧眼。此处“满目山河”二语，“重、拙、大”兼而有之，《晏殊》中仅此而已。');
insert into poem
values
  (304,
   302,
   '采桑子·群芳过后西湖好',
   '群芳过后西湖好，狼藉残红，飞絮濛濛。垂柳阑干尽日风。笙歌散尽游人去，始觉春空。垂下帘栊。双燕归来细雨中。',
   '虽说是百花凋落，暮春时节的西湖依然是美的，残花轻盈飘落，点点残红在纷杂的枝叶间分外醒目；柳絮时而飘浮，时而飞旋，舞弄得迷迷蒙蒙；杨柳向下垂落，纵横交错，在和风中随风飘荡，摇曳多姿，在和煦的春风中，怡然自得，整日轻拂着湖水。游人尽兴散去，笙箫歌声也渐渐静息，才开始觉得一片空寂，又仿佛正需要这份安谧。回到居室，拉起窗帘，等待着燕子的来临，只见双燕从蒙蒙细雨中归来，这才拉起了帘子。',
   '①群芳过后：百花凋谢。②西湖：指安徽颍州西湖。欧阳修晚年退居颍州。③狼籍残红：残花纵横散乱的样子。残红，落花。狼籍，同“狼藉”，散乱的样子。④濛濛：今写作“蒙蒙”。细雨迷蒙的样子，以此形容飞扬的柳絮。⑤阑干：纵横交错的样子⑥笙歌：笙管伴奏的歌筵。  散：消失，此指曲乐声停止。  春空：春去后的空虚寂寞。⑦帘栊：有帘子的窗。栊，窗棂。',
   '这首词通篇写景，不带明显的主观感情色彩，却从字里行间婉曲地显露出作者的旷达胸怀和恬淡心境。此词表现出词人别具慧眼的审美特点，尤其最后两句营造出耐人寻味的意境。作者写西湖美景，动静交错，以动显静，意脉贯串，层次井然，显示出不凡的艺术功力。西湖花时过后，群芳凋零，残红狼藉。常人对此，当觉索然无味，而作者却面对这种“匆匆春又去”的衰残景象，不但不感伤，反而在孤寂清冷中体味出安宁静谧的美趣。这种春空之后的闲淡胸怀，这种别具一格的审美感受，正是此词有异于一般咏春词的独到之处。');
insert into poem
values
  (305,
   302,
   '踏莎行·候馆梅残',
   '候馆梅残，溪桥柳细，草熏风暖摇征辔。离愁渐远渐无穷。迢迢不断如春水。寸寸柔肠，盈盈粉泪，楼高莫近危栏倚。平芜尽处是春山，行人更在春山外。',
   '春暖了，旅舍的寒梅日渐凋谢，只剩细细碎碎几片残瓣儿；溪桥边的柳树却萌出了浅绿嫩芽。暖暖的春风在大地上拂过，风中带了花草芳香，远行的人，也都在这时动身了。在这美好的春光里，我也送走了你。你渐行渐远，我的愁绪也渐生渐多，就像眼前这一江春水，来路无穷，去程不尽。我肝肠寸断，泪流满面，别上楼去倚着那高高的阑干痴望，绵绵无绝的春草原野，原野尽处是隐隐青山。而你，更在遥远的青山之外，渺不可寻！',
   '①候馆：迎宾候客之馆舍。②征辔（pèi）：行人坐骑的缰绳。辔，缰绳。③粉泪：泪水流到脸上，与粉妆和在一起。④危栏：高楼上的栏杆。⑤平芜：平坦的草地。',
   '“离愁渐远渐无穷，迢迢不断如春水。”可是这明媚的春景并没有给旅人增添一点快乐，相反，他离家越来越远，就越来越感到那一片离愁的沉重，他似乎在逐渐的扩散开来，变成了一片无穷无尽、看不到头尾的绵绵不断的春水。抽象的感情，在词人的笔下，变成了具体的形象，使人容易感受，容易亲切。“离愁渐远渐无穷”这七字，构思巧妙，着意在“远”与“无穷”的关系上。离愁可以说轻重，而这里却说它无穷，而且是越远越无穷。这就把旅人在路上走着的感觉，形象而又生动地表现出来了。');
commit;

/*==============================================================*/
/* Table: FAVORITE                                              */
/*==============================================================*/

insert into favorite values(300, 300, '所有欧阳修的词');
insert into favorite values(301, 300, '所有范仲淹的词');
insert into favorite values(302, 300, '我喜欢的词');
insert into favorite values(303, 300, '混搭的词');
commit;

/*==============================================================*/
/* Table: FAVORITE_POEM                                         */
/*==============================================================*/

insert into favorite_poem values(304, 300);
insert into favorite_poem values(305, 300);
insert into favorite_poem values(300, 301);
insert into favorite_poem values(301, 301);
insert into favorite_poem values(300, 302);
insert into favorite_poem values(301, 302);
insert into favorite_poem values(302, 302);
insert into favorite_poem values(303, 302);
insert into favorite_poem values(304, 302);
insert into favorite_poem values(305, 302);
insert into favorite_poem values(300, 303);
insert into favorite_poem values(302, 303);
insert into favorite_poem values(304, 303);
commit;

/*==============================================================*/
/* Table: MYNEWPOEM                                             */
/* My new poem still lack some functional implement,            */
/* I will fix it when I have enough time.                       */
/*==============================================================*/

insert into mynewpoem values(300, 300, 300, sysdate, null, 0);
insert into mynewpoem values(301, 300, 301, sysdate, null, 0);
insert into mynewpoem values(302, 300, 302, sysdate, null, 0);
insert into mynewpoem values(303, 300, 303, sysdate, null, 0);
insert into mynewpoem values(304, 300, 304, sysdate, null, 0);
commit;


